Clarify documentation
